Revit 2017 API
StructuralSectionHotRolled Class
 Defines parameters for hot rolled structural sections.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015
Syntax
C#
public class StructuralSectionHotRolled : StructuralSectionRectangular
Visual Basic
Public Class StructuralSectionHotRolled _
	Inherits StructuralSectionRectangular
Visual C++
public ref class StructuralSectionHotRolled : public StructuralSectionRectangular
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCParallelFlange
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCSlopedFlange
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIParallelFlange
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISlopedFlange
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISplitParallelFlange
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISplitSlopedFlange
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWideFlange
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLAngle
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionStructuralTees
See Also
StructuralSectionHotRolled Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace